---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralElementDefinitionData
source: html/d2a74e60-6419-d2ae-9da7-f1aa1d03145d.htm
---
# StructuralElementDefinitionData Properties

The curve lying in the geometrical center of the element.